[ {
  "id" : "24451940-3c5f-11eb-9dd0-dba4e30f3307-1",
  "name" : "Nokia",
  "createdDate" : 0,
  "text" : "Preface: This is not what would be considered a smartphone in the United States (Nothing on the par of Android, iPhone, or Windows Phone), it is basically a feature phone. Also, although it says here that it has a US warranty all of the warranty material it came with referenced Latin American countries so I am not sure if it is really covered under a US Warranty. I returned it during Amazon's return window so it wasn't an issue. Now for the phone review.Pros: The phone has a great keyboard. If you are familiar with the E-series phones its that type of keyboard. The interface is some sort of modified Symbian and I liked it in a lot of ways. The style of the hardware is attractive and the Gray is a nice color. The camera was pretty decent considering it is only 2 megapixels. For e-mail it's adequate.Cons: I'll start with the small issues and work up to the big problem that ultimately made me decide to return the phone. The onboard social network apps are not fully functional. You can update your Facebook or Twitter status but the rest of it is so-so. The Ovi store in general is a poor app store, but this phone isn't able to use many of them. Even the old Facebook app that I used on my old E71 (It used to be called Snaptu but Facebook has since renamed it to Facebook for Everyone) is incompatible with this phone as are most of the better apps in the Ovi store. The browser was mediocre, barely passable. Also, NO GPS for this phone. Nokia/Ovi Maps is incompatible which is too bad because that has always been a Nokia strength. That immediately eliminates this phone as a smart phone. With all of that said, I bought this phone for my wife and she really only needed a phone for texts and calls so we could have overlooked these things. The problem we could not overlook was the very shabby, flimsy piece of metal that was supposed to hold in place the standard sim card. This little piece of metal was barely attached to the phone and would not lock into place to hold down the sim card. Because the sim card would intermittently get lose inside the phone and constantly lose the signal. So we would have to take the battery out and re-adjust the sim card. Then it would work for a little while only to ultimately have to repeat the process. It was WAY more frustration than it was worth. It's too bad because as a basic phone for calls, texts, e-mail, and occasionally updating your Facebook/Twitter status; this phone has a lot of potential. Becuase of the problem with the sim card holder, however, it was essentially unusable. I have used Nokia phones for years (I use a Lumia 710 personally) and I am really surprised Nokia would do such a sloppy job on something as important as the part that holds the sim card in place. What a waste.",
  "status" : "SUBMITTED",
  "modifiedDate" : 1607766489301
}, {
  "id" : "24451940-3c5f-11eb-9dd0-dba4e30f3307-3",
  "name" : "Apple",
  "createdDate" : 0,
  "text" : "Moving from Android to Apple...my kids have this phone too and keep me straight on using it. Phone is superb and, while Apple has its moments, it is intuitive to use. Seller was VERY responsive...only reason not a 5 star is \"new\" phone had been opened for imei verification. Not sure that's industry standard. If it is, seller is 5 star.",
  "status" : "SUBMITTED",
  "modifiedDate" : 1607766489301
}, {
  "id" : "24451940-3c5f-11eb-9dd0-dba4e30f3307-9",
  "name" : "BLU",
  "createdDate" : 0,
  "text" : "This affordable smart phone really surprised me. The software is a little generic, but it does what you expect from a unlocked device. I would recommend. Iwouldnt recommended rooting this phone unless you truely know what ur doing. Once rooted don't do the wireless update. Like I did even after reading forum that advised against it. I soft bricked my phone. Which caused it to get stuct on a bootloader loop. Eg. Stuck on phone logo. Their are a lot of good tools on the net to reverse this problem if you understand the concepts. Unlike me I don't really understand the rooting process. Just wanted to be able to get browser apk to install. But anyways if you do get stuck on bootloader loop.... Visit needrom.com their is all the tools and info to turn ur dead droid into a zombie droid. Also you will have to create a free account to be able to DL ROMs and tools to flash your phone. Also check fourms @ android area51 and don't forget your friends @ xda a lot of good info. I hope this helps someone cause finding info on this phone is few and far between. But I enjoy this phone. And theirs really no need to root this phone. Like I said I wanted the old web browser. But its not worth soft bricking to get it",
  "status" : "SUBMITTED",
  "modifiedDate" : 1607766489301
}, {
  "id" : "2c011440-3c5f-11eb-8b8a-43f5000567e8-1",
  "name" : "Samsung",
  "createdDate" : 0,
  "text" : "I purchased this phone in December as a christmas present to my son. I called sprint to activate the phone only to find out the ESN wasn't clear. I was told to come into the store and upon research the phone wasn't clear. I reached out to this company to inform them that this ESN wasn't clean. I was told to send the phone back and they would send out another phone. I asked the representative to provide me with the ESN # so that I could call and make sure it was clear. I was told that they didn't have to phone available and was guaranteed it would be clear. I should've known something was wrong then. I received a second phone that turned out not have a clear ESN. The representative at Sprint informed me that the seller of these phones are aware the the ESN isn't clear. So once again I had to send another phone back. I asked for a refund for the phone and shipping since the sent me two phones that didn't have a clear ESN. I received my refund for the phone but have yet to see a refund for the shipping. I wouldn't suggest you buy anything from them.",
  "status" : "SUBMITTED",
  "modifiedDate" : 1607766502277
}, {
  "id" : "2c011440-3c5f-11eb-8b8a-43f5000567e8-3",
  "name" : "Yezz Wireless Ltd.",
  "createdDate" : 0,
  "text" : "Very poor quality. Has the oldest version of Android on them, Bought them to take on a deployment. These were the slowest and I could not use them. Threw them in the trash. Dont buy.",
  "status" : "SUBMITTED",
  "modifiedDate" : 1607792578261
}, {
  "id" : "32afbdf0-3c5f-11eb-8b8a-43f5000567e8-1",
  "name" : "BlackBerry",
  "createdDate" : 0,
  "text" : "i bought this Bold las december, got it and started using it with the same chip from my old Blackberry. Two weeks ago I decided to register the Bold at the cellphone company and suprise suprise I could not do it because the cellphone serial number is already register under another person's name.... They wouldn't give me detail due to privacy policy. Also the Bold is really slow... I prefer my Samsung 100 times.Compré esta negrita las diciembre, recibí y comencé a usarlo con el mismo chip de mi viejo Blackberry. Hace dos semanas me decidí a registrar el intrépido en la empresa de telefonía celular y sorpresa sorpresa! No pude registrarlo porque el número de serial del teléfono móvil ya está registrado a nombre de otra persona .... No me dieron detalles debido a la política de confidencialidad.",
  "status" : "SUBMITTED",
  "modifiedDate" : 1607792500110
}, {
  "id" : "32afbdf0-3c5f-11eb-8b8a-43f5000567e8-2",
  "name" : "BLU",
  "createdDate" : 0,
  "text" : "Considering that this is not an expensive phone with some ridiculous specs, this phone does everything it says it will do. The material is not the best but it comes with a case that you can use to add some protection just in case the phone is dropped.I think the picture quality is decent considering the price of the phone.Overall, if you are on a budget and looking for a phone capable of all the functions of some of the industry leaders (Galaxy S series), this is definitely a good buy.NOTE: I purchased the Global GSM version to use outside the United states. This version is not made for use in the United States. Based on what I've read, if you use the Global GSM version in the United States, you might experience slow data speeds.",
  "status" : "SUBMITTED",
  "modifiedDate" : 1607790540308
} ]